app/views/rooms/index.html.erb

SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = ?  [["room_id", 1]]
---
          </nav>
          <% @room.messages.each do |message| %>