app/views/rooms/index.html.erb

SELECT COUNT(*) FROM "users" INNER JOIN "messages" ON "users"."id" = "messages"."user_id" WHERE "messages"."room_id" = ?  [["room_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "messages" ON "users"."id" = "messages"."user_id" WHERE "messages"."room_id" = ?  [["room_id", 1]]
---
          <span class="member-count">
            <small><%= room.users.uniq.count %> Members</small>

SELECT "users".* FROM "users" INNER JOIN "messages" ON "users"."id" = "messages"."user_id" WHERE "messages"."room_id" = ?  [["room_id", 1]]
---
              <br>
              <small><%= @room.users.uniq.count %> Members</small>

SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = ?  [["room_id", 1]]
---
          <div id="messages">
          <% @room.messages.each do |message| %>