app/controllers/application_controller.rb

  def current_user
    return @current_user if @current_user.present?

    if session[:user_id].present?
      @current_user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]