app/controllers/messages_controller.rb

  def create
    @message = Message.new(message_params)
    @message.user = current_user
    @message.save
---
INSERT INTO "messages" ("content", "user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Hello world!"], ["user_id", 2], ["room_id", 1], ["created_at", "2021-04-27 21:15:44.509532"], ["updated_at", "2021-04-27 21:15:44.509532"]]